beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_Interrupts.c
/* Copyright (c) 2006-2012 MIS Institute of the HEIG-VD affiliated to the University of
** Applied Sciences of Western Switzerland. All rights reserved.
** Permission to use, copy, modify, and distribute this software and its documentation
** for any purpose, without fee, and without written agreement is hereby granted, pro-
** vided that the above copyright notice, the following three sentences and the authors
** appear in all copies of this software and in the software where it is used.
** IN NO EVENT SHALL THE MIS INSTITUTE NOR THE HEIG-VD NOR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL,
** INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS
** DOCUMENTATION, EVEN IF THE MIS INSTITUTE OR THE HEIG-VD OR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
** THE MIS INSTITUTE, THE HEIG-VD AND THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWIT-
** ZERLAND SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
** IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFT-
** WARE PROVIDED HEREUNDER IS ON AN "AS IS" BASIS, AND THE MIS INSTITUTE NOR THE HEIG-VD
** AND NOR THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWITZERLAND HAVE NO OBLIGATION
** TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
*/
/* File ZottaOS_Interrupts.c:
** Platform version: All STM32 microcontrollers.
** Version date: March 2012
** Authors: MIS-TIC
*/

#include "ZottaOS.h"
#include "ZottaOS_Timer.h"


/* STM32 specific interrupt vector table, which is added by the linker at the end of table
** CortextM3VectorTable which is defined in ZottaOS_CortexM3.c. */
#if defined(STM32L151X6_X8_XB) || defined(STM32L152X6_X8_XB)
   void *_OSTabDevice[44];
#elif defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
   void *_OSTabDevice[56];
#elif defined(STM32F101T8_TB) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101X4_X6)
   void *_OSTabDevice[42];
#elif defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F102X4_X6) || \
      defined(STM32F102X8_XB)
   void *_OSTabDevice[43];
#elif defined(STM32F100X4_X6) || defined(STM32F100X8_XB)
   void *_OSTabDevice[56];
#elif defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
   void *_OSTabDevice[60];
#elif defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
   void *_OSTabDevice[61];
#elif defined(STM32F105XX) || defined(STM32F107XX)
   void *_OSTabDevice[68];
#elif defined(STM32F2XXXX)
   void *_OSTabDevice[81];
#elif defined(STM32F4XXXX)
   static TIMERSELECT Timer9ISRSelect  = {_OSTimerSelector,{NULL,NULL},{0x40010000,0x40014000},0x80};
   static TIMERSELECT Timer10ISRSelect = {_OSTimerSelector,{NULL,NULL},{0x40010000,0x40014400},0x01};
   static TIMERSELECT Timer11ISRSelect = {_OSTimerSelector,{NULL,NULL},{0x40010000,0x40014800},0x40};
   static TIMERSELECT Timer12ISRSelect = {_OSTimerSelector,{NULL,NULL},{0x40010400,0x40001800},0x80};
   static TIMERSELECT Timer13ISRSelect = {_OSTimerSelector,{NULL,NULL},{0x40010400,0x40001C00},0x01};
   static TIMERSELECT Timer14ISRSelect = {_OSTimerSelector,{NULL,NULL},{0x40010400,0x40002000},0x40};
   void *_OSTabDevice[82] = {
           NULL, /* OS_IO_WWDG                    0  Window WatchDog */
           NULL, /* OS_IO_PVD                     1  PVD through EXTI Line detection */
           NULL, /* OS_IO_TAMP_STAMP              2  Tamper and TimeStamp through the EXTI
                                                     line*/
           NULL, /* OS_IO_RTC_WKUP                3  RTC Wakeup through the EXTI line */
           NULL, /* OS_IO_FLASH                   4  FLASH global */
           NULL, /* OS_IO_RCC                     5  RCC global */
           NULL, /* OS_IO_EXTI0                   6  EXTI Line0 */
           NULL, /* OS_IO_EXTI1                   7  EXTI Line1 */
           NULL, /* OS_IO_EXTI2                   8  EXTI Line2 */
           NULL, /* OS_IO_EXTI3                   9  EXTI Line3 */
           NULL, /* OS_IO_EXTI4                  10  EXTI Line4 */
           NULL, /* OS_IO_DMA1_Stream0           11  DMA1 Stream 0 global */
           NULL, /* OS_IO_DMA1_Stream1           12  DMA1 Stream 1 global */
           NULL, /* OS_IO_DMA1_Stream2           13  DMA1 Stream 2 global */
           NULL, /* OS_IO_DMA1_Stream3           14  DMA1 Stream 3 global */
           NULL, /* OS_IO_DMA1_Stream4           15  DMA1 Stream 4 global */
           NULL, /* OS_IO_DMA1_Stream5           16  DMA1 Stream 5 global */
           NULL, /* OS_IO_DMA1_Stream6           17  DMA1 Stream 6 global */
           NULL,  /* OS_IO_ADC                   18  ADC1, ADC2 and ADC3 global  */
           NULL,  /* OS_IO_CAN1_TX               19  CAN1 TX */
           NULL,  /* OS_IO_CAN1_RX0              20  CAN1 RX0 */
           NULL,  /* OS_IO_CAN1_RX1              21  CAN1 RX1 */
           NULL,  /* OS_IO_CAN1_SCE              22  CAN1 SCE */
           NULL,  /* OS_IO_EXTI9_5               23  External Line[9:5]  */
           &Timer9ISRSelect,  /* OS_IO_TIM1_BRK_TIM9      24  TIM1 Break and TIM9 global */
           &Timer10ISRSelect, /* OS_IO_TIM1_UP_TIM10      25  TIM1 Update and TIM10 global */
           &Timer11ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM11 26  TIM1 Trigger and Commutation and TIM11 global */
           NULL,  /* OS_IO_TIM1_CC               27  TIM1 Capture Compare */
           NULL,  /* OS_IO_TIM2                  28  TIM2 global */
           NULL,  /* OS_IO_TIM3                  29  TIM3 global */
           NULL,  /* OS_IO_TIM4                  30  TIM4 global */
           NULL,  /* OS_IO_I2C1_EV               31  I2C1 Event */
           NULL,  /* OS_IO_I2C1_ER               32  I2C1 Error */
           NULL,  /* OS_IO_I2C2_EV               33  I2C2 Event */
           NULL,  /* OS_IO_I2C2_ER               34  I2C2 Error */
           NULL,  /* OS_IO_SPI1                  35  SPI1 global */
           NULL,  /* OS_IO_SPI2                  36  SPI2 global */
           NULL,  /* OS_IO_USART1                37  USART1 global */
           NULL,  /* OS_IO_USART2                38  USART2 global */
           NULL,  /* OS_IO_USART3                39  USART3 global */
           NULL,  /* OS_IO_EXTI15_10             40  External Line[15:10]  */
           NULL,  /* OS_IO_RTC_Alarm             41  RTC Alarm (A and B) through EXTI Line */
           NULL,  /* OS_IO_OTG_FS_WKUP           42  USB OTG FS Wakeup through EXTI line */
           &Timer12ISRSelect, /* OS_IO_TIM8_BRK_TIM12     43  TIM8 Break and TIM12 global */
           &Timer13ISRSelect, /* OS_IO_TIM8_UP_TIM13      44  TIM8 Update and TIM13 global */
           &Timer14ISRSelect, /* OS_IO_TIM8_TRG_COM_TIM14 45  TIM8 Trigger and Commutation and TIM14 global */
           NULL,  /* OS_IO_TIM8_CC      46  TIM8 Capture Compare */
           NULL,  /* OS_IO_DMA1_Stream7          47  DMA1 Stream7 */
           NULL,  /* OS_IO_FSMC                  48  FSMC global */
           NULL,  /* OS_IO_SDIO                  49  SDIO global */
           NULL,  /* OS_IO_TIM5                  50  TIM5 global */
           NULL,  /* OS_IO_SPI3                  51  SPI3 global */
           NULL,  /* OS_IO_UART4                 52  UART4 global */
           NULL,  /* OS_IO_UART5                 53  UART5 global */
           NULL,  /* OS_IO_TIM6_DAC              54  TIM6 global and DAC1&2 underrun error */
           NULL,  /* OS_IO_TIM7                  55  TIM7 global */
           NULL,  /* OS_IO_DMA2_Stream0          56  DMA2 Stream 0 global */
           NULL,  /* OS_IO_DMA2_Stream1          57  DMA2 Stream 1 global */
           NULL,  /* OS_IO_DMA2_Stream2          58  DMA2 Stream 2 global */
           NULL,  /* OS_IO_DMA2_Stream3          59  DMA2 Stream 3 global */
           NULL,  /* OS_IO_DMA2_Stream4          60  DMA2 Stream 4 global */
           NULL,  /* OS_IO_ETH                   61  Ethernet global */
           NULL,  /* OS_IO_ETH_WKUP              62  Ethernet Wakeup through EXTI line */
           NULL,  /* OS_IO_CAN2_TX               63  CAN2 TX */
           NULL,  /* OS_IO_CAN2_RX0              64  CAN2 RX0 */
           NULL,  /* OS_IO_CAN2_RX1              65  CAN2 RX1 */
           NULL,  /* OS_IO_CAN2_SCE              66  CAN2 SCE */
           NULL,  /* OS_IO_OTG_FS                67  USB OTG FS global */
           NULL,  /* OS_IO_DMA2_Stream5          68  DMA2 Stream 5 global */
           NULL,  /* OS_IO_DMA2_Stream6          69  DMA2 Stream 6 global */
           NULL,  /* OS_IO_DMA2_Stream7          70  DMA2 Stream 7 global */
           NULL,  /* OS_IO_USART6                71  USART6 global */
           NULL,  /* OS_IO_I2C3_EV               72  I2C3 event */
           NULL,  /* OS_IO_I2C3_ER               73  I2C3 error */
           NULL,  /* OS_IO_OTG_HS_EP1_OUT        74  USB OTG HS End Point 1 Out global */
           NULL,  /* OS_IO_OTG_HS_EP1_IN         75  USB OTG HS End Point 1 In global */
           NULL,  /* OS_IO_OTG_HS_WKUP           76  USB OTG HS Wakeup through EXTI */
           NULL,  /* OS_IO_OTG_HS                77  USB OTG HS global */
           NULL,  /* OS_IO_DCMI                  78  DCMI global */
           NULL,  /* OS_IO_CRYP                  79  CRYP crypto global */
           NULL,  /* OS_IO_HASH_RNG              80  Hash and Rng global */
           NULL}; /* OS_IO_FPU                   81  FPU global */
#else
  #error STM32 version undefined
#endif


